Revit 2027 API
BuiltInFailures.EditingFailures.OwnElementsOutOfDate Property
 You now own the element, but your file is out of date. You must Reload Latest before editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OwnElementsOutOfDate { get; }
Public Shared ReadOnly Property OwnElementsOutOfDate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OwnElementsOutOfDate {
	FailureDefinitionId^ get ();
}
static member OwnElementsOutOfDate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace